# IFCCategory Template Is Valid Category Mapping File Property

Source: https://www.revitapidocs.com/2026/a0b47162-2abc-27c5-9991-9460f1cc5303.htm

---

| IFCCategory Template Is Valid Category Mapping File Property |
| --- |

Whether or not the category mapping file is valid.
**Namespace:** Autodesk.Revit.DB
**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26\.0\.4\.0 (26\.0\.4\.0\) Syntax C\# VB C\+\+ F\#
```
public bool IsValidCategoryMappingFile { get; set; }
```

```
Public Property IsValidCategoryMappingFile As Boolean
	Get
	Set
```

```
public:
property bool IsValidCategoryMappingFile {
	bool get ();
	void set (bool value);
}
```

```
member IsValidCategoryMappingFile : bool with get, set
```

#### Property Value

Boolean See Also

#### Reference

IFCCategoryTemplate Class Autodesk.Revit.DB Namespace